In [1]:
import numpy as np
import pandas as pd

In [5]:

l=[["Shah" ,"Male", 114000.00],
["Vats" ,"Male", 65000.00],
["Vats" ,"Female", 43150.00],
["Kumar" ,"Female", 69500.00],
["Vats" ,"Female", 155000.00],
["Kumar" ,"Male", 103000.00],
["Shah" ,"Male", 55000.00],
["Shah" ,"Female", 112400.00],
["Kumar","Female", 81030.00],
["Vats" ,"Male", 71900.00]]
df=pd.DataFrame(l,columns=["Name","Gender","Monthly Income"])
df

    Name  Gender  Monthly Income
0   Shah    Male        114000.0
1   Vats    Male         65000.0
2   Vats  Female         43150.0
3  Kumar  Female         69500.0
4   Vats  Female        155000.0
5  Kumar    Male        103000.0
6   Shah    Male         55000.0
7   Shah  Female        112400.0
8  Kumar  Female         81030.0
9   Vats    Male         71900.0

In [18]:
print("Familywise gross monthly income")
pd.DataFrame(df.groupby('Name')['Monthly Income'].sum())

Familywise gross monthly income

       Monthly Income
Name
Kumar        253530.0
Shah         281400.0
Vats         335050.0

In [20]:
print("Member with the highest monthly income in a family")
pd.DataFrame(df.groupby('Name')['Monthly Income'].max())

Member with the highest monthly income in a family

       Monthly Income
Name
Kumar        103000.0
Shah         114000.0
Vats         155000.0

In [23]:
print("Members with monthly income more than 60000")
df[df['Monthly Income']>60000]

Members with monthly income more than 60000

    Name  Gender  Monthly Income
0   Shah    Male        114000.0
1   Vats    Male         65000.0
3  Kumar  Female         69500.0
4   Vats  Female        155000.0
5  Kumar    Male        103000.0
7   Shah  Female        112400.0
8  Kumar  Female         81030.0
9   Vats    Male         71900.0

In [32]:
df[df['Name']=="Shah"][df['Gender']=='Female']['Monthly Income'].mean()

/tmp/ipykernel_7750/3309929452.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['Name']=="Shah"][df['Gender']=='Female']['Monthly Income'].mean()

112400.0